Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །ཀཽ་ཤི་ཀ་དེ་ལྟར་ན་མིག་གི་རྣམ་པར་ཤེས་པ་སྟོང་པ་ཉིད་དང་རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་སྣའི་རྣམ་པར་ཤེས་པ་དང་ལྕེའི་རྣམ་པར་ཤེས་པ་དང་ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་སྟོང་པ་ཉིད་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྟོང་པ་ཉིད་དེ་ལ་གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་དོ།
en: Thus, Kauśika, the emptiness of visual consciousness and the emptiness of auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, and mental consciousness on the one hand, and this emptiness of the bodhisattvas on the other, are not two things, and are not to be divided into two. “

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་མིག་གི་འདུས་ཏེ་རེག་པ་ནི་མིག་གི་འདུས་ཏེ་རེག་པས་སྟོང་ངོ་། རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་སྣའི་འདུས་ཏེ་རེག་པ་དང་ལྕེའི་འདུས་ཏེ་རེག་པ་དང་ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་ནི་ཡིད་ཀྱི་འདུས་ཏེ་རེག་པས་སྟོང་ངོ་། །བྱང་ཆུབ་སེམས་དཔའ་ནི་བྱང་ཆུབ་སེམས་དཔས་སྟོང་ངོ་། །ཀཽ་ཤི་ཀ་དེ་ལྟར་ན་མིག་གི་འདུས་ཏེ་རེག་པ་སྟོང་པ་ཉིད་དང་། རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་།
en: Moreover, Kauśika, visually compounded sensory contact is empty of visually compounded sensory contact, and aurally compounded sensory contact, nasally compounded sensory contact, lingually compounded sensory contact, corporeally compounded sensory contact, and mentally compounded sensory contact are empty of mentally compounded sensory contact [and those other aspects of sensory contact]. The bodhisattvas are empty of the bodhisattvas.

source: སྣའི་འདུས་ཏེ་རེག་པ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་སྟོང་པ་ཉིད་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྟོང་པ་ཉིད་དེ་ལ་གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་དོ་ཀཽ་ཤི་ཀ་གཞན་ཡང་མིག་གི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་ནི་མིག་གི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བས་སྟོང་ངོ་།
en: Thus, Kauśika, the emptiness of visually compounded sensory contact and the emptiness of aurally compounded sensory contact, nasally compounded sensory contact, lingually compounded sensory contact, corporeally compounded sensory contact, and mentally compounded sensory contact on the one hand, and this emptiness of the bodhisattvas on the other, are not two things, and are not to be divided into two. “

source: །རྣ་བའི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་དང་།
en: Moreover, Kauśika, feelings arising from visually compounded sensory contact are empty of feelings arising from visually compounded sensory contact.

source: སྣའི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་དང་ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་ནི་ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བས་སྟོང་ངོ་། །བྱང་ཆུབ་སེམས་དཔའ་ནི་བྱང་ཆུབ་སེམས་དཔས་སྟོང་ངོ་། །ཀཽ་ཤི་ཀ་དེ་ལྟར་ན་མིག་གི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་སྟོང་པ་ཉིད་དང་།
en: Feelings arising from aurally compounded sensory contact, feelings arising from nasally compounded sensory contact, feelings arising from lingually compounded sensory contact, feelings arising from corporeally compounded sensory contact, and feelings arising from mentally compounded sensory contact are empty of feelings arising from mentally compounded sensory contact [and those other aspects of feelings arising from sensory contact].

source: རྣ་བའི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་དང་།
en: The bodhisattvas are empty of the bodhisattvas.

source: སྣའི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་སྟོང་པ་ཉིད་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྟོང་པ་ཉིད་དེ་ལ་གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་དོ།
en: Thus, Kauśika, the emptiness of feelings arising from visually compounded sensory contact and the emptiness of feelings arising from aurally compounded sensory contact, feelings arising from nasally compounded sensory contact, feelings arising from lingually compounded sensory contact, feelings arising from corporeally compounded sensory contact, and feelings arising from mentally compounded sensory contact on the one hand, and this emptiness of the bodhisattvas on the other, are not two things, and are not to be divided into two.

source: །ཀཽ་ཤི་ཀ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་དེ་ལྟར་གནས་པར་བྱའོ།
en: Kauśika, bodhisattva great beings should dwell accordingly in the perfection of wisdom. “

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་སའི་ཁམས་ནི་སའི་ཁམས་ཀྱིས་སྟོང་ངོ་། །ཆུའི་ཁམས་དང་མེའི་ཁམས་དང་རླུང་གི་ཁམས་དང་ནམ་མཁའི་ཁམས་དང་རྣམ་པར་ཤེས་པའི་ཁམས་ནི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱིས་སྟོང་ངོ་།
en: Moreover, Kauśika, the earth element is empty of the earth element, and the water element, the fire element, the wind element, the space element, and the consciousness element are empty of the consciousness element [and those other elements]. {Ki.

source: །ཀཽ་ཤི་ཀ་དེ་ལྟར་ན་སའི་ཁམས་སྟོང་པ་ཉིད་དང་ཆུའི་ཁམས་དང་མེའི་ཁམས་དང་རླུང་གི་ཁམས་དང་ནམ་མཁའི་ཁམས་དང་རྣམ་པར་ཤེས་པའི་ཁམས་སྟོང་པ་ཉིད་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྟོང་པ་ཉིད་དེ་ལ་གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་དོ།
en: Thus, Kauśika, the emptiness of the earth element and the emptiness of the water element, the fire element, the wind element, the space element, and the consciousness element on the one hand, and this emptiness of the bodhisattvas on the other, are not two things, and are not to be divided into two.

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་མ་རིག་པ་ནི་མ་རིག་པས་སྟོང་ངོ་།
en: Moreover, Kauśika, ignorance is empty of ignorance.

source: །འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་དང་མིང་དང་གཟུགས་དང་སྐྱེ་མཆེད་དྲུག་དང་རེག་པ་དང་ཚོར་བ་དང་སྲེད་པ་དང་ལེན་པ་དང་སྲིད་པ་དང་སྐྱེ་བ་དང་རྒ་ཤི་ནི་རྒ་ཤིས་སྟོང་ངོ་།
en: Formative predispositions, consciousness, name and form, the six sense fields, sensory contact, sensation, craving, grasping, the rebirth process, actual birth, and aging and death are empty of aging and death [and those other links of dependent origination].

source: ཀཽ་ཤི་ཀ་དེ་ལྟར་ན་མ་རིག་པ་སྟོང་པ་ཉིད་དང་། འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་དང་མིང་དང་གཟུགས་དང་སྐྱེ་མཆེད་དྲུག་དང་རེག་པ་དང་ཚོར་བ་དང་སྲེད་པ་དང་ལེན་པ་དང་སྲིད་པ་དང་སྐྱེ་བ་དང་རྒ་ཤི་སྟོང་པ་ཉིད་དང་བྱང་ཆུབ་སེམས་དཔའ་སྟོང་པ་ཉིད་དེ་ལ་གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་དོ།
en: Thus, Kauśika, the emptiness of ignorance and the emptiness of formative predispositions, consciousness, name and form, the six sense fields, sensory contact, sensation, craving, grasping, the rebirth process, actual birth, and aging and death on the one hand, and this emptiness of the bodhisattvas on the other, are not two things, and are not to be divided into two.

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་མ་རིག་པ་འགགས་པ་ནི་མ་རིག་པ་འགགས་པས་སྟོང་ངོ་།
en: Moreover, Kauśika, the cessation of ignorance is empty of the cessation of ignorance.

source: །དེ་བཞིན་དུ་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་དང་མིང་དང་གཟུགས་དང་སྐྱེ་མཆེད་དྲུག་དང་རེག་པ་དང་ཚོར་བ་དང་སྲེད་པ་དང་ལེན་པ་དང་སྲིད་པ་དང་སྐྱེ་བ་དང་རྒ་ཤི་འགགས་པ་ནི་རྒ་ཤི་འགགས་པས་སྟོང་ངོ་།
en: Similarly, the cessations of formative predispositions, consciousness, name and form, the six sense fields, sensory contact, sensation, craving, grasping, the rebirth process, actual birth, and aging and death are empty of the cessation of aging and death [and those other links of cessation].

source: །བྱང་ཆུབ་སེམས་དཔའ་ནི་བྱང་ཆུབ་སེམས་དཔས་སྟོང་སྟེ།
en: The bodhisattvas are empty of the bodhisattvas.

source: དེ་ལྟར་ན་མ་རིག་པ་འགགས་པ་སྟོང་པ་ཉིད་དང་། རྒ་ཤི་འགགས་པ་སྟོང་པ་ཉིད་དང་བྱང་ཆུབ་སེམས་དཔའ་སྟོང་པ་ཉིད་དེ་ལ་གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་དེ།
en: Thus, Kauśika, the emptiness of the cessation of ignorance and the emptiness of the cessation of aging and death [and so forth] on the one hand, and this emptiness of the bodhisattvas on the other, are not two things, and are not to be divided into two.

source: ཀཽ་ཤི་ཀ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་དེ་ལྟར་གནས་པར་བྱའོ།
en: Kauśika, bodhisattva great beings should dwell accordingly in the perfection of wisdom. “

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པས་སྟོང་ངོ་།
en: Moreover, Kauśika, the perfection of generosity is empty of the perfection of generosity.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་སྟོང་ངོ་།
en: The perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom are empty of the perfection of wisdom [and so forth].

source: །བྱང་ཆུབ་སེམས་དཔའ་ནི་བྱང་ཆུབ་སེམས་དཔས་སྟོང་ངོ་། །ཀཽ་ཤི་ཀ་དེ་ལྟར་ན་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་པ་ཉིད་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: The bodhisattvas are empty of the bodhisattvas.

source: བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་པ་ཉིད་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྟོང་པ་ཉིད་དེ་ལ་གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་དོ།
en: Thus, Kauśika, the emptiness of the perfection of generosity and the emptiness of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom on the one hand, and this emptiness of the bodhisattvas on the other, are not two things, and are not to be divided into two.

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་ནང་སྟོང་པ་ཉིད་ནི་ནང་སྟོང་པ་ཉིད་ཀྱིས་སྟོང་ངོ་། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ནི་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱིས་སྟོང་ངོ་།
en: Moreover, Kauśika, the emptiness of internal phenomena is empty of the emptiness of internal phenomena, and [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are empty of the emptiness of the essential nature of nonentities [and so forth].

source: །ཀཽ་ཤི་ཀ་དེ་ལྟར་ན་ནང་སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་སྟོང་པ་ཉིད་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྟོང་པ་ཉིད་དེ་ལ་གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་དེ།
en: Thus, Kauśika, the emptiness of the emptiness of internal phenomena and the emptiness of [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, on the one hand, and this emptiness of the bodhisattvas on the other, are not two things, and are not to be divided into two.

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ནི་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱིས་སྟོང་ངོ་། །ཡང་དག་པར་སྤོང་བ་དང་རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་སྟོབས་དང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ནི་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པས་སྟོང་ངོ་།
en: Moreover, Kauśika, the applications of mindfulness are empty of the applications of mindfulness, and the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path are empty of the noble eightfold path [and those other causal attributes].

source: །བྱང་ཆུབ་སེམས་དཔའ་ནི་བྱང་ཆུབ་སེམས་དཔས་སྟོང་ངོ་།།
en: The bodhisattvas are empty of the bodhisattvas.

source: ཀཽ་ཤི་ཀ་དེ་ལྟར་ན་དྲན་པ་ཉེ་བར་གཞག་པ་སྟོང་པ་ཉིད་དང་། ཡང་དག་པར་སྤོང་བ་དང་རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་དབང་པོ་དང་སྟོབས་དང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་སྟོང་པ་ཉིད་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྟོང་པ་ཉིད་དེ་ལ་གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་དོ།
en: Thus, Kauśika, the emptiness of the applications of mindfulness and the emptiness of the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path on the one hand, and this emptiness of the bodhisattvas on the other, are not two things, and are not to be divided into two.

source: །ཀཽ་ཤི་ཀ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་དེ་ལྟར་གནས་པར་བྱའོ། །ཀཽ་ཤི་ཀ་འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་ཚད་མེད་པ་རྣམས་དང་།
en: Kauśika, bodhisattva great beings should dwell accordingly in the perfection of wisdom. “

source: གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་མཐར་ཀྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་མི་འཇིགས་པ་བཞི་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ནི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱིས་སྟོང་ངོ་།
en: Kauśika, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas are empty of the eighteen distinct qualities of the buddhas [and those other meditative and fruitional attributes].

source: །བྱང་ཆུབ་སེམས་དཔའ་ནི་བྱང་ཆུབ་སེམས་དཔས་སྟོང་ངོ་། །ཀཽ་ཤི་ཀ་དེ་ལྟར་ན་འཕགས་པའི་བདེན་པ་སྟོང་པ་ཉིད་དང་།
en: The bodhisattvas are empty of the bodhisattvas.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའི་བར་སྟོང་པ་ཉིད་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྟོང་པ་ཉིད་དེ་ལ་གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་དོ།
en: Thus, Kauśika, the emptiness of the truths of the noble ones and the emptiness of those [other meditative and fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, on the one hand, and this emptiness of the bodhisattvas on the other, are not two things, and are not to be divided into two.

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་ཉན་ཐོས་ཀྱི་ཐེག་པ་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པས་སྟོང་ངོ་། །རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ནི་རང་སངས་རྒྱས་ཀྱི་ཐེག་པས་སྟོང་ངོ་། །སངས་རྒྱས་ཀྱི་ཐེག་པ་ནི་སངས་རྒྱས་ཀྱི་ཐེག་པས་སྟོང་ངོ་།
en: II-III: 7} “Moreover, Kauśika, the vehicle of the śrāvakas is empty of the vehicle of the śrāvakas, the vehicle of the pratyekabuddhas is empty of the vehicle of the pratyekabuddhas, and the vehicle of the buddhas is empty of the vehicle of the buddhas.

source: །ཀཽ་ཤི་ཀ་དེ་ལྟར་ན་ཉན་ཐོས་ཀྱི་ཐེག་པ་སྟོང་པ་ཉིད་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་སྟོང་པ་ཉིད་དང་། སངས་རྒྱས་ཀྱི་ཐེག་པ་སྟོང་པ་ཉིད་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྟོང་པ་ཉིད་དེ་ལ་གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་དེ།
en: Thus, Kauśika, the emptiness of the vehicle of the śrāvakas, the emptiness of the vehicle of the pratyekabuddhas, and the emptiness of the vehicle of the buddhas on the one hand, and this emptiness of the bodhisattvas on the other, are not two things, and are not to be divided into two.

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་ཉན་ཐོས་ནི་ཉན་ཐོས་ཀྱིས་སྟོང་ངོ་། །རང་སངས་རྒྱས་ནི་རང་སངས་རྒྱས་ཀྱིས་སྟོང་ངོ་། །སངས་རྒྱས་ནི་སངས་རྒྱས་ཀྱིས་སྟོང་ངོ་།
en: Moreover, Kauśika, the śrāvakas are empty of the śrāvakas, the pratyekabuddhas are empty of the pratyekabuddhas, and the buddhas are empty of the buddhas.

source: །ཀཽ་ཤི་ཀ་དེ་ལྟར་ན་ཉན་ཐོས་སྟོང་པ་ཉིད་དང་། རང་སངས་རྒྱས་སྟོང་པ་ཉིད་དང་། སངས་རྒྱས་སྟོང་པ་ཉིད་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྟོང་པ་ཉིད་དེ་ལ་གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་དེ།
en: Thus, Kauśika, the emptiness of the śrāvakas, the emptiness of the pratyekabuddhas, and the emptiness of the buddhas on the one hand, and this emptiness of the bodhisattvas on the other, are not two things, and are not to be divided into two.

source: ཀཽ་ཤི་ཀ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་དེ་ལྟར་གནས་པར་བྱའོ། །ཀཽ་ཤི་ཀ་གཞན་ཡང་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ནི་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུས་སྟོང་ངོ་། །ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་།
en: Kauśika, bodhisattva great beings should dwell accordingly in the perfection of wisdom. “

source: ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱིས་སྟོང་ངོ་།
en: Moreover, Kauśika, the fruit of entering the stream to nirvāṇa is empty of the fruit of entering the stream to nirvāṇa, and the fruit of being destined for only one more rebirth, the fruit of not being subject to further rebirth, arhatship, individual enlightenment, knowledge of the path, and all-aspect omniscience are empty of all-aspect omniscience [and those other realizations].

source: །བྱང་ཆུབ་སེམས་དཔའ་ནི་བྱང་ཆུབ་སེམས་དཔས་སྟོང་ངོ་། །ཀཽ་ཤི་ཀ་དེ་ལྟར་ན་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་སྟོང་པ་ཉིད་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་།
en: The bodhisattvas are empty of the bodhisattvas.

source: ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་སྟོང་པ་ཉིད་དང་།
en: Thus, Kauśika, the emptiness of the fruit of entering the stream to nirvāṇa and the emptiness of the fruit of being destined for only one more rebirth, the fruit of not being subject to further rebirth, arhatship, individual enlightenment, knowledge of the path, and all-aspect omniscience on the one hand, and this emptiness of the bodhisattvas on the other, are not two things, and are not to be divided into two.

source: བྱང་ཆུབ་སེམས་དཔའ་སྟོང་པ་ཉིད་དེ་ལ་གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་དོ། །ཀཽ་ཤི་ཀ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་དེ་ལྟར་གནས་པར་བྱའོ།
en: Kauśika, bodhisattva great beings should dwell accordingly in the perfection of wisdom.”

source: །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་གནས་བརྟན་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཙུན་པ་རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པས་གནས་པར་མི་བྱ།
en: Then Śakra, mighty lord of the gods, asked the elder Subhūti, “Blessed Subhūti, in what way should bodhisattva great beings who practice the perfection of wisdom not dwell?” “

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། ཀཽ་ཤི་ཀ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། དམིགས་པའི་ཚུལ་གྱིས་གཟུགས་ལ་གནས་པར་མི་བྱའོ།
en: Kauśika,” replied Subhūti, “in this regard, bodhisattva great beings who practice the perfection of wisdom should not, by way of apprehending, dwell on physical forms.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་གནས་པར་མི་བྱའོ།
en: They should not, by way of apprehending, dwell on feelings, perceptions, formative predispositions, or consciousness.

source: །དམིགས་པའི་ཚུལ་གྱིས་མིག་ལ་གནས་པར་མི་བྱའོ། །རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་ཡིད་ལ་གནས་པར་མི་བྱའོ།
en: They should not, by way of apprehending, dwell on the eyes, and they should not, by way of apprehending, dwell on the ears, nose, tongue, body, or mental faculty.

source: །དམིགས་པའི་ཚུལ་གྱིས་གཟུགས་ལ་གནས་པར་མི་བྱའོ། །སྒྲ་དང་དྲི་དང་རོ་དང་རེག་དང་ཆོས་ལ་གནས་པར་མི་བྱའོ། །དམིགས་པའི་ཚུལ་གྱིས་མིག་གི་རྣམ་པར་ཤེས་པ་ལ་གནས་པར་མི་བྱའོ། །རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་སྣའི་རྣམ་པར་ཤེས་པ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་།
en: They should not, by way of apprehending, dwell on sights, and they should not, by way of apprehending, dwell on sounds, odors, tastes, tangibles, or mental phenomena.

source: ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ལ་གནས་པར་མི་བྱའོ། །དམིགས་པའི་ཚུལ་གྱིས་མིག་གི་འདུས་ཏེ་རེག་པ་ལ་གནས་པར་མི་བྱའོ། །རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་། སྣའི་འདུས་ཏེ་རེག་པ་དང་།
en: They should not, by way of apprehending, dwell on visual consciousness, and they should not, by way of apprehending, dwell on auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, or mental consciousness.

source: ལྕེའི་འདུས་ཏེ་རེག་པ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་ལ་གནས་པར་མི་བྱའོ། །དམིགས་པའི་ཚུལ་གྱིས་མིག་གི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་ལ་གནས་པར་མི་བྱའོ། །རྣ་བའི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་དང་།
en: They should not, by way of apprehending, dwell on visually compounded sensory contact, and they should not, by way of apprehending, dwell on aurally compounded sensory contact, nasally compounded sensory contact, lingually compounded sensory contact, corporeally compounded sensory contact, or mentally compounded sensory contact.

source: སྣའི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་ལ་གནས་པར་མི་བྱའོ། །དམིགས་པའི་ཚུལ་གྱིས་སའི་ཁམས་ལ་གནས་པར་མི་བྱའོ།
en: They should not, by way of apprehending, dwell on feelings arising from visually compounded sensory contact, and they should not, by way of apprehending, dwell on feelings arising from aurally compounded sensory contact, feelings arising from nasally compounded sensory contact, feelings arising from lingually compounded sensory contact, feelings arising from corporeally compounded sensory contact, or feelings arising from mentally compounded sensory contact.

source: །ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་། ནམ་མཁའི་ཁམས་དང་། རྣམ་པར་ཤེས་པའི་ཁམས་ལ་གནས་པར་མི་བྱའོ།
en: They should not, by way of apprehending, dwell on the earth element, and they should not, by way of apprehending, dwell on the water element, the fire element, the wind element, the space element, or the consciousness element.

source: །དམིགས་པའི་ཚུལ་གྱིས་མ་རིག་པ་ལ་གནས་པར་མི་བྱའོ། །འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་དང་མིང་དང་གཟུགས་དང་སྐྱེ་མཆེད་དྲུག་དང་། རེག་པ་དང་ཚོར་བ་དང་སྲེད་པ་དང་ལེན་པ་དང་སྲིད་པ་དང་སྐྱེ་བ་དང་། རྒ་ཤི་ལ་གནས་པར་མི་བྱའོ། །དམིགས་པའི་ཚུལ་གྱིས་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་པར་མི་བྱའོ།
en: They should not, by way of apprehending, dwell on ignorance, and they should not, by way of apprehending, dwell on formative predispositions, consciousness, name and form, the six sense fields, sensory contact, sensation, craving, grasping, the rebirth process, actual birth, or aging and death.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་པར་མི་བྱའོ།
en: They should not, by way of apprehending, dwell on the perfection of generosity, and they should not, by way of apprehending, dwell on the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, or the perfection of wisdom.

source: །དམིགས་པའི་ཚུལ་གྱིས་ནང་སྟོང་པ་ཉིད་ལ་གནས་པར་མི་བྱའོ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་གནས་པར་མི་བྱའོ།
en: They should not, by way of apprehending, dwell on the emptiness of internal phenomena and they should not, by way of apprehending, dwell on [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: །དམིགས་པའི་ཚུལ་གྱིས་དྲན་པ་ཉེ་བར་བཞག་པ་རྣམས་ལ་གནས་པར་མི་བྱའོ། །ཡང་དག་པར་སྤོང་བ་དང་རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་དབང་པོ་དང་སྟོབས་དང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་གནས་པར་མི་བྱའོ། །དམིགས་པའི་ཚུལ་གྱིས་འཕགས་པའི་བདེན་པ་རྣམས་དང་བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་།
en: They should not, by way of apprehending, dwell on the applications of mindfulness, and they should not, by way of apprehending, dwell on the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, or the noble eightfold path.

source: སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་གནས་པར་མི་བྱའོ།
en: They should not, by way of apprehending, dwell on the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, or the eighteen distinct qualities of the buddhas.

source: །དམིགས་པའི་ཚུལ་གྱིས་ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་གནས་པར་མི་བྱའོ།
en: They should not, by way of apprehending, dwell on the vehicle of the śrāvakas.

source: །དམིགས་པའི་ཚུལ་གྱིས་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་གནས་པར་མི་བྱའོ།
en: They should not, by way of apprehending, dwell on the vehicle of the pratyekabuddhas.

source: །དམིགས་པའི་ཚུལ་གྱིས་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་གནས་པར་མི་བྱའོ།
en: They should not, by way of apprehending, dwell on the vehicle of the buddhas.
